app/controllers/tasks_controller.rb

    task = Task.new({
      title: params[:task][:title],
      description: params[:task][:description]
      })
    task.save
---
INSERT INTO "tasks" ("title", "description") VALUES ($1, $2) RETURNING "id"  [["title", "Do laundry"], ["description", "put detergent in as well"]]

  task = Task.find(params[:id])
  task.update({
    title: params[:task][:title],
    description: params[:task][:description]
    })
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1 WHERE "tasks"."id" = $2  [["description", "Just kidding, pay someone to do it."], ["id", 1]]

  def destroy
  Task.destroy(params[:id])
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]